In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0045601.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(4, 8)

In [7]:
df.head(5)

        0     1              2             3               4   5   6   7
0     NaN   NaN  Albers  7,156  Beach  6,955  Totals  14,111 NaN NaN NaN
1     NaN   NaN          50.7%         49.3%          100.0% NaN NaN NaN
2  County   PPR            NaN           NaN             NaN NaN NaN NaN
3  FULTON  100%           7156          6955           14111 NaN NaN NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

        0     1     2     3      4   5   6   7
3  FULTON  100%  7156  6955  14111 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

        0     2     3
3  FULTON  7156  6955

In [12]:
df.columns = ['county', 'John Albers', 'Brandon Beach']

In [13]:
df.tail(5)

   county John Albers Brandon Beach
3  FULTON        7156          6955

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

   county      candidate votes
0  FULTON    John Albers  7156
1  FULTON  Brandon Beach  6955

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
county       2 non-null object
candidate    2 non-null object
votes        2 non-null int64
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [19]:
df['office'] = 'State Senate'

In [20]:
df['district'] = '56'

In [21]:
df['party'] = 'Republican'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate      party
Brandon Beach  Republican    6955
John Albers    Republican    7156
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

   county        office district       party      candidate  votes
0  FULTON  State Senate       56  Republican    John Albers   7156
1  FULTON  State Senate       56  Republican  Brandon Beach   6955

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')